CSI API ETABS v1
cDStCanadian_S16_14 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDStCanadian_S16_14
Public Interface cDStCanadian_S16_14
Dim instance As cDStCanadian_S16_14
public interface class cDStCanadian_S16_14
type cDStCanadian_S16_14 =  interface end
The cDStCanadian_S16_14 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a steel design overwrite item
GetPreference
 Retrieves the value of a steel design preference item
SetOverwrite
 Sets the value of a steel design overwrite item
SetPreference
 Sets the value of a steel design preference item
Top
See Also
Reference
ETABSv1 Namespace